# 1.     Write a Python program to remove spaces from a given string.

In [6]:
def remove(string):
    return string.replace(" ", "")
string=' p y t h o n '
print(remove(string))

python

# 2.     Write a function which accepts a string and returns only the last word of the sentence.

In [57]:
string="We are have finished our class"
a=string.split()
print(a[-1])

class

### 3.     Fetch top 3 items from the given dictionary based on its value
#Sample data: {'item1': 45.50, 'item2':35, 'item3': 41.30, 'item4':55, 'item5': 24}
#Expected Output:item4 55, item1 45.5,item3 41.3

In [87]:
from heapq import nlargest
Sample_data={'item1': 45.50,
             'item2':35, 
             'item3': 41.30,
             'item4':55, 
             'item5': 24}
three_highest = nlargest(3, Sample_data, key = Sample_data.get)
for value in three_highest:
    print(value,':', Sample_data.get(value))

item4 : 55
item1 : 45.5
item3 : 41.3

In [7]:
import pandas as pd

In [8]:
Sample_data={'item1': 45.50,
             'item2':35, 
             'item3': 41.30,
             'item4':55, 
             'item5': 24}

In [11]:
pd.DataFrame([Sample_data])

   item1  item2  item3  item4  item5
0   45.5     35   41.3     55     24

In [13]:
pd.DataFrame([Sample_data]).T

          0
item1  45.5
item2  35.0
item3  41.3
item4  55.0
item5  24.0

In [18]:
df=pd.DataFrame([Sample_data]).T.reset_index()
df

   index     0
0  item1  45.5
1  item2  35.0
2  item3  41.3
3  item4  55.0
4  item5  24.0

In [20]:
df.columns=['items','price']
df

   items  price
0  item1   45.5
1  item2   35.0
2  item3   41.3
3  item4   55.0
4  item5   24.0

In [21]:
df.sort_values(by='price').tail(3)

   items  price
2  item3   41.3
0  item1   45.5
3  item4   55.0

In [23]:
df.sort_values(by='price',ascending=False).head(3)

   items  price
3  item4   55.0
0  item1   45.5
2  item3   41.3

# 4.  Write a python program to combine two dictionary adding key for common keys
d1 = {'a': 100, 'b': 200, 'c':300}
d2 = {'a': 300, 'b': 200, ’d’:400}
 
Output: {'a': 400, 'b': 400, 'd': 400, 'c': 300}

In [66]:
d1 = {'a': 100, 'b': 200, 'c':300}
d2 = {'a': 300, 'b': 200, 'd':400}

In [67]:
for key in d1:
    if key in d2:
        d1[key] = d1[key] + d2[key]
          
print(d1)

{'a': 400, 'b': 400, 'c': 300}